Revit 2026 API

# IExporterIFC Interface

---

The interface used to implement a custom IFC exporter.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IExporterIFC : IExternalServer
```
```vb
Public Interface IExporterIFC
	Inherits IExternalServer
```
```cpp
public interface class IExporterIFC : IExternalServer
```
```fsharp
type IExporterIFC =
    interface
        interface IExternalServer
    end
```

The IExporterIFC type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExportIFC | The method that Revit will invoke to perform an export to IFC. |
|  | GetDescription | Implement this method to return a description of the server. (Inherited from IExternalServer) |
|  | GetName | Implement this method to return the name of the server. (Inherited from IExternalServer) |
|  | GetServerId | Implement this method to return the id of the server. (Inherited from IExternalServer) |
|  | GetServiceId | Implement this method to return the id of the service. (Inherited from IExternalServer) |
|  | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from IExternalServer) |

Implement this interface and register an instance of the derived class with ExporterIFCRegistry.

#### Reference

Autodesk.Revit.DB.IFC Namespace